Tekla Open API Reference for Tekla Structures 2025
View.ViewFilter Property
The name of the view filter. 256 characters at most.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string ViewFilter { get; set; }
Public Property ViewFilter As String
	Get
	Set
Property Value
Type: String
See Also
Reference
View Class
Tekla.Structures.Model.UI Namespace